ode-soap-performance/bpelContent/Trigonometrical.wsdl

<?xml version="1.0" encoding="UTF-8"?><!-- Published by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.2.4-b01. --><!-- Generated by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.2.4-b01. --><definitions xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://www.wscomposition.org/Trigonometrical/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://www.wscomposition.org/Trigonometrical/" name="Trigonometrical">
    <types>
        <xsd:schema>
            <xsd:import namespace="http://www.wscomposition.org/Trigonometrical/" schemaLocation="Trigonometrical.xsd"></xsd:import>
        </xsd:schema>
    </types>
    <message name="SinRequest">
        <part name="angle" type="xsd:int"></part>
    </message>
    <message name="SinRequestResponse">
        <part name="return" type="tns:trigonometricalResponse"></part>
    </message>
    <message name="CosRequest">
        <part name="angle" type="xsd:int"></part>
    </message>
    <message name="CosRequestResponse">
        <part name="return" type="tns:trigonometricalResponse"></part>
    </message>
    <portType name="TrigonometricalServiceImpl">
        <operation name="SinRequest">
            <input wsam:Action="http://www.wscomposition.org/Trigonometrical/TrigonometricalServiceImpl/SinRequestRequest" message="tns:SinRequest"></input>
            <output wsam:Action="http://www.wscomposition.org/Trigonometrical/TrigonometricalServiceImpl/SinRequestResponse" message="tns:SinRequestResponse"></output>
        </operation>
        <operation name="CosRequest">
            <input wsam:Action="http://www.wscomposition.org/Trigonometrical/TrigonometricalServiceImpl/CosRequestRequest" message="tns:CosRequest"></input>
            <output wsam:Action="http://www.wscomposition.org/Trigonometrical/TrigonometricalServiceImpl/CosRequestResponse" message="tns:CosRequestResponse"></output>
        </operation>
    </portType>
    <binding name="TrigonometricalSOAPBinding" type="tns:TrigonometricalServiceImpl">
        <soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="rpc"></soap:binding>
        <operation name="SinRequest">
            <soap:operation soapAction=""></soap:operation>
            <input>
                <soap:body use="literal" namespace="http://www.wscomposition.org/Trigonometrical/"></soap:body>
            </input>
            <output>
                <soap:body use="literal" namespace="http://www.wscomposition.org/Trigonometrical/"></soap:body>
            </output>
        </operation>
        <operation name="CosRequest">
            <soap:operation soapAction=""></soap:operation>
            <input>
                <soap:body use="literal" namespace="http://www.wscomposition.org/Trigonometrical/"></soap:body>
            </input>
            <output>
                <soap:body use="literal" namespace="http://www.wscomposition.org/Trigonometrical/"></soap:body>
            </output>
        </operation>
    </binding>
    <service name="Trigonometrical">
        <port name="TrigonometricalSOAP" binding="tns:TrigonometricalSOAPBinding">
            <soap:address location="http://192.168.243.87:8080/trigonometrical/Trigonometrical"></soap:address>
        </port>
    </service>
</definitions>