mule-soap-performance/target/classes/CosRequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:trig="http://www.wscomposition.org/Trigonometrical/">
   <soapenv:Header/>
   <soapenv:Body>
      <trig:CosRequest>
         <angle></angle>
      </trig:CosRequest>
   </soapenv:Body>
</soapenv:Envelope>